trade_exp/src/Documents/ПроверкаЦенников/ПроверкаЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fd17951c-1da2-49db-9c7e-f3150fc241fe">
  <name>ПроверкаЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="4a70e6fe-639f-44de-b3fd-237230052dc1">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5034a4d7-93d7-48ba-a44d-fdf429bc2eac">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7b9df7f-e2d1-4043-b06e-85fd4416f45a">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c849c33d-d44b-4398-9231-c9df953c93e2">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f9936d4d-9ec9-462a-8a56-f4dc8a27e883">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="59518efd-1ffc-47bb-919d-987145052d36">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33f586b2-0658-4db5-a72d-9f3fb3f64b70">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d65bbef-e89d-4630-ad15-da4215e03885">
    <name>ОтборПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2c0981d1-37a3-4097-943b-888d82353308">
    <name>ДополнительноеСведениеКолонки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6412a95-3905-47a5-b58c-42ddc3273893">
    <name>ВидПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6ed79a42-e86c-4a2e-bcdd-4741381451bd">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="85673eb7-8a97-4e43-8918-bc1fd724a199">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00cebe0f-6fe8-498f-9da3-00097fb7b1ff">
      <name>ЦенаТекущая</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="43b8f031-f17d-450b-8d5d-9331b98c3e40">
      <name>ЦенаНаЦеннике</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bee02909-0b00-49d6-8e3a-17bdc46db3f3">
      <name>ЕстьРасхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b14de1c9-ce62-446e-b7f4-1e380660b377">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="307a9612-2229-444e-9ab6-16cbcdd055e0">
      <name>НетЦенника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12fd7174-1d80-46c0-8a1c-1bef2134ec91">
      <name>ДополнительноеСведение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c7bc165d-b056-49f4-9989-2b83551a416e">
      <name>Проверено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ПроверкаЦенников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать 

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПроверкаЦенников";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПроверкаЦенников";
	КомандаПечати.Представление = НСтр("ru = 'Печать'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.СразуНаПринтер = Ложь;
	КомандаПечати.Порядок = 1;	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПроверкаЦенников") Тогда
		ТабДок = СформироватьПроверкуЦенников(МассивОбъектов, ОбъектыПечати);		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПроверкаЦенников", 
			НСтр("ru = 'Проверка ценников'"), ТабДок) //, "Документ.ПроверкаЦенников.ПФ_MXL_ПроверкаЦенников");
	КонецЕсли;
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);	
КонецПроцедуры	


Функция СформироватьПроверкуЦенников(МассивОбъектов, ОбъектыПечати) Экспорт
	
	Ссылка = МассивОбъектов[0];
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПроверкаЦенников.ПФ_MXL_ПроверкаЦенников");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ОбластьШтрихкода = Макет.ПолучитьОбласть("ОбластьШтрихкода");
	ОбластьШапки = Макет.ПолучитьОбласть("ОбластьШапки");
	ОбластьЗаголовка = Макет.ПолучитьОбласть("ОбластьЗаголовка");
	ОбластьСтроки = Макет.ПолучитьОбласть("ОбластьСтроки");
	ОбластьПодвала = Макет.ПолучитьОбласть("ОбластьПодвала");
	
	
	ЗапросПоШапке = Новый Запрос;
	ЗапросПоШапке.Текст = 
	"ВЫБРАТЬ
	|	ПроверкаЦенников.Ссылка КАК Ссылка,
	|	ПроверкаЦенников.Номер КАК Номер,
	|	ПроверкаЦенников.Дата КАК Дата,
	|	ПроверкаЦенников.Склад.Представление КАК Склад,
	|	ПроверкаЦенников.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ПроверкаЦенников КАК ПроверкаЦенников
	|ГДЕ
	|	ПроверкаЦенников.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Дата";
	
	ЗапросПоШапке.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	РезультатПоШапке = ЗапросПоШапке.Выполнить().Выгрузить();
	
	ПерваяСтрокаОбъектов = Истина;
	ПервыйДокумент = Истина;
	
	Для Каждого Строка Из РезультатПоШапке Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент ИЛИ (ПервыйДокумент И НЕ ПерваяСтрокаОбъектов) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;

		ОбластьШапки.Параметры.НомерДокумента = Строка.Номер;
		ОбластьШапки.Параметры.ДатаДокумента = Строка.Дата;
		ОбластьШапки.Параметры.Склад = Строка.Склад;
		ОбластьШапки.Параметры.Исполнитель = Строка.Ответственный;
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШапки, Строка.Ссылка);

		
		ТабличныйДокумент.Вывести(ОбластьШапки);
		ТабличныйДокумент.Вывести(ОбластьЗаголовка);

		ЗапросПоТоварам = Новый Запрос;
		ЗапросПоТоварам.УстановитьПараметр("МассивОбъектов", Строка.Ссылка);
		
		ТекстЗапросаПоТоварам = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Номенклатура.Код КАК Код,
		|	ТаблицаТовары.Номенклатура.Артикул КАК Артикул,
		|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТовары.НетЦенника КАК НетЦенника,
		|	ТаблицаТовары.ЕстьРасхождения КАК ЕстьРасхождения,		
		|	ДополнительныеСведения.Значение КАК ДополнительноеСведение
		|ИЗ
		|	Документ.ПроверкаЦенников.Товары КАК ТаблицаТовары
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|	ПО ТаблицаТовары.Номенклатура.Ссылка = ДополнительныеСведения.Объект 
        |		И ДополнительныеСведения.Свойство = ТаблицаТовары.Ссылка.ДополнительноеСведениеКолонки
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	ТаблицаТовары.НомерСтроки";
		
		ЗапросПоТоварам.Текст = ТекстЗапросаПоТоварам;
		ВыборкаПоТоварам = ЗапросПоТоварам.Выполнить().Выбрать();
					
		// Выборка товаров
			
		НомерСтроки = 1;
			
		Пока ВыборкаПоТоварам.НайтиСледующий(Новый Структура("Ссылка", Строка.Ссылка)) Цикл
				
			//ОбластьСтроки.Параметры.Номер = НомерСтроки;
			ОбластьСтроки.Параметры.Номер = ВыборкаПоТоварам.НомерСтроки;
			ОбластьСтроки.Параметры.Код = ВыборкаПоТоварам.Код;
			ОбластьСтроки.Параметры.Номенклатура = ВыборкаПоТоварам.Номенклатура;
			ОбластьСтроки.Параметры.Сведение = ВыборкаПоТоварам.ДополнительноеСведение;
			ОбластьСтроки.Параметры.ЕстьРасхождения = ВыборкаПоТоварам.ЕстьРасхождения;
			
			ТабличныйДокумент.Вывести(ОбластьСтроки);
			
			НомерСтроки = НомерСтроки + 1;
								
		КонецЦикла;
			
			
		ТабличныйДокумент.Вывести(ОбластьПодвала);
		
		ПерваяСтрокаОбъектов = Ложь;
		
	КонецЦикла;
	
	
	Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти


#КонецЕсли
